# 03/05 - Pair Programming Limpieza I - Lidia y Tatiana

# Ejercicio 1
Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna m√°s. En este caso vamos tendr√©is que eliminar las columnas que no nos sean √∫tiles para contestar a nuestras preguntas. Pero ojo ‚ö†Ô∏è, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.

.

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("attackito_supremo.csv", index_col=0)
df.head(3)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson¬†McNeely,F,11,14h00 -15h00,NaN,N,Minor injury to left thigh,18-Jun-2018
2,2018.06.09,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,07h45,NaN,N,Injury to left lower leg from surfboard skeg,09-Jun-2018

In [2]:
df_copia= pd.DataFrame(df)

In [3]:
df_copia.drop(["area", "location", "case_number", "activity", "name", "time", "injury"], axis=1, inplace = True)
df_copia.columns

Index(['year', 'type', 'country', 'sex_', 'age', 'species_', 'fatal_(y/n)',
       'date'],
      dtype='object')

# Ejercicio 2
Hay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndolos.

In [4]:
df_copia.duplicated().sum()

47

In [5]:
df_copia.drop_duplicates(inplace = True)
df_copia.duplicated().sum()

0

# Ejercicio 3
Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para la columna de year.

In [6]:
df_copia.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6237 entries, 0 to 6283
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         6237 non-null   float64
 1   type         6233 non-null   object
 2   country      6188 non-null   object
 3   sex_         5675 non-null   object
 4   age          3459 non-null   object
 5   species_     3443 non-null   object
 6   fatal_(y/n)  5705 non-null   object
 7   date         6237 non-null   object
dtypes: float64(1), object(7)
memory usage: 438.5+ KB

In [8]:
df_copia["year"] = df_copia["year"].astype('Int64', errors = "ignore") 
df_copia.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6237 entries, 0 to 6283
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         6237 non-null   Int64
 1   type         6233 non-null   object
 2   country      6188 non-null   object
 3   sex_         5675 non-null   object
 4   age          3459 non-null   object
 5   species_     3443 non-null   object
 6   fatal_(y/n)  5705 non-null   object
 7   date         6237 non-null   object
dtypes: Int64(1), object(7)
memory usage: 444.6+ KB

# Ejercicio 4
En la columna de country poner todos los valores en min√∫sculas.
üí° Pista Tendr√©is que usar una funci√≥n o una lambda üí°

In [12]:
def minuscula (x):
    try:
        return x.lower()
    except:
        return np.NaN

In [18]:
df_copia["country"] = df_copia["country"].apply(minuscula)
df_copia.sample(3)

,year,type,country,sex_,age,species_,fatal_(y/n),date
4791,1939,Boating,bahamas,NaN,NaN,Tiger shark,N,Ca. 1939
3959,1960,Unprovoked,usa,M,14,NaN,N,22-Aug-1960
2864,1984,Provoked,usa,M,29,"""a small shark""",N,04-Nov-1984

# Ejercicio 5
Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza

In [19]:
df_copia.to_csv("limpieza_1.csv")